sdlc/Agile_And_Other_Methodologies/Agile_And_Other_Methodologies.org
#+BEGIN_HTML
<meta http-equiv="Content-Style-Type" content="text/css">
<link rel="stylesheet" href="org-style.css" type="text/css" />
<style type="text/css"/></style>
#+END_HTML

#+TITLE: Agile and other methodologies.

#+BEGIN_HTML
<div id="postamble">
<p class="author"> Author: Pralay Patoria
<a href="mailto:ppatoria@gmail.com">&lt;ppatoria@gmail.com&gt;</a>
</p>
<p class="date"> Date: 25-12-2013</p>
</div>
#+END_HTML

#+OPTIONS: date:nil, creator:nil, author:nil				

[TABLE-OF-CONTENTS]

* Software Development Methodologies 
/Reference:/ http://www.codeproject.com/Articles/124732/Software-Development-Methodologies

* Agile Methodology.
** Scrum : 
    Is Interactive. Client is also involved.
    Consist of :
    1. Product Owner : Proxy to client. In case of Agora a BA.
    2. Srum Master   : Project Manager.
    3. Developers    

    - sprint 
    - Daily scrum meetings
*** References: 
    http://www.codeproject.com/Articles/573908/Agile-Scrum-and-Customer-Oriented-Development
    http://www.codeproject.com/Articles/4798/What-is-SCRUM

** Test Driven Development
    - Unit Test Framework
        * Mock classes   

** Continous integration.
    - Unit Test before build.
    - nightly builds

** Jira and other tools
