sdlc/Agile_And_Other_Methodologies/Agile_And_Other_Methodologies.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Agile and other methodologies.</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-12-25 23:12:55 "/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Agile and other methodologies.</h1>


<meta http-equiv="Content-Style-Type" content="text/css">
<link rel="stylesheet" href="org-style.css" type="text/css" />
<style type="text/css"/></style>


<div id="postamble">
<p class="author"> Author: Pralay Patoria
<a href="mailto:ppatoria@gmail.com">&lt;ppatoria@gmail.com&gt;</a>
</p>
<p class="date"> Date: 25-12-2013</p>
</div>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Software Development Methodologies </a></li>
<li><a href="#sec-2">2 Agile Methodology. </a>
<ul>
<li><a href="#sec-2_1">2.1 Scrum : </a>
<ul>
<li><a href="#sec-2_1_1">2.1.1 References: </a></li>
</ul>
</li>
<li><a href="#sec-2_2">2.2 Test Driven Development </a></li>
<li><a href="#sec-2_3">2.3 Continous integration. </a></li>
<li><a href="#sec-2_4">2.4 Jira and other tools </a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Software Development Methodologies </h2>
<div class="outline-text-2" id="text-1">

<p><i>Reference:</i> <a href="http://www.codeproject.com/Articles/124732/Software-Development-Methodologies">http://www.codeproject.com/Articles/124732/Software-Development-Methodologies</a>
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Agile Methodology. </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> Scrum : </h3>
<div class="outline-text-3" id="text-2_1">

<p>Is Interactive. Client is also involved.
Consist of :
</p><ol>
<li>
Product Owner : Proxy to client. In case of Agora a BA.
</li>
<li>
Srum Master   : Project Manager.
</li>
<li>
Developers    

</li>
<li>
sprint 
</li>
<li>
Daily scrum meetings
</li>
</ol>

</div>

<div id="outline-container-2_1_1" class="outline-4">
<h4 id="sec-2_1_1"><span class="section-number-4">2.1.1</span> References: </h4>
<div class="outline-text-4" id="text-2_1_1">

<p><a href="http://www.codeproject.com/Articles/573908/Agile-Scrum-and-Customer-Oriented-Development">http://www.codeproject.com/Articles/573908/Agile-Scrum-and-Customer-Oriented-Development</a>
<a href="http://www.codeproject.com/Articles/4798/What-is-SCRUM">http://www.codeproject.com/Articles/4798/What-is-SCRUM</a>
</p>
</div>
</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> Test Driven Development </h3>
<div class="outline-text-3" id="text-2_2">

<ul>
<li>
Unit Test Framework
<ul>
<li>
Mock classes   

</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-2_3" class="outline-3">
<h3 id="sec-2_3"><span class="section-number-3">2.3</span> Continous integration. </h3>
<div class="outline-text-3" id="text-2_3">

<ul>
<li>
Unit Test before build.
</li>
<li>
nightly builds

</li>
</ul>
</div>

</div>

<div id="outline-container-2_4" class="outline-3">
<h3 id="sec-2_4"><span class="section-number-3">2.4</span> Jira and other tools </h3>
<div class="outline-text-3" id="text-2_4">

</div>
</div>
</div>
<div id="postamble">
<p class="date"> Date: 2013-12-25 23:12:55 </p>
</div>
</div>
</body>
</html>
